Catalogs/Корзины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Корзины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКорзины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Корзины/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрыТовара") Тогда
		
		НоваяСтрока = Объект.СоставКорзины.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры.ПараметрыТовара);
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
		Записать();
		
	КонецЕсли;
	
	Элементы.СоставКорзиныХарактеристикаНоменклатуры.Видимость = 
		ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненаПопыткаПереносаТоваровИзКорзиныВЗаказ" Тогда
		
		Если ОчищатьПослеПереносаВЗаказ Тогда
			
			Объект.СоставКорзины.Очистить();
			
			Для каждого Элемент Из Параметр Цикл
				
				Если Элемент.Пометка Тогда
					НоваяСтрока = Объект.СоставКорзины.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.Значение); 
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКорзины

&НаКлиенте
Процедура СоставКорзиныПриИзменении(Элемент)
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКорзиныНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКорзины.ТекущиеДанные;
	
	ТекущиеДанные.Количество = 1;
	
	ТекущиеДанные.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Очистить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект), "Очистить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.СоставКорзины.Очистить();
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВЗаказ(Команда)
	
	Если Объект.СоставКорзины.Количество() = 0 Тогда
		ТекстСообщения = "Нет товаров для переноса.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ТоварыКорзины = ПолучитьТоварыКорзины();
	
	Если ТоварыКорзины = Неопределено Тогда
	  Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТоварыКорзины", ТоварыКорзины);
	
	ОткрытьФорму("Документ.Заказ.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает список значений со структурами данных товаров корзины
//
&НаКлиенте
Функция ПолучитьТоварыКорзины()

	ТоварыКорзины = Новый СписокЗначений;
	
	ЕстьНезаполненныеСтроки = Ложь;
	
	Для каждого Стр Из Объект.СоставКорзины Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			ТекстСообщения = "В строке " + Стр.НомерСтроки + " не выбран товар!";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,ЕстьНезаполненныеСтроки); 
		КонецЕсли;
		
		Если Стр.Количество = 0 Тогда
			ТекстСообщения = "В строке " + Стр.НомерСтроки + " не введено количество!";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,ЕстьНезаполненныеСтроки); 
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			ТекстСообщения = "В строке " + Стр.НомерСтроки + " не заполнена единица измерения!";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,ЕстьНезаполненныеСтроки); 
		КонецЕсли;
		
		Если НЕ ЕстьНезаполненныеСтроки Тогда
			Товар = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения") ;
			ЗаполнитьЗначенияСвойств(Товар, Стр);
			ТоварыКорзины.Добавить(Товар);
		КонецЕсли;
		 
	КонецЦикла;
	
	Если ЕстьНезаполненныеСтроки Тогда
		Возврат Неопределено;
	Иначе
		Возврат ТоварыКорзины;
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмерения(Номенклатура)
	
	Возврат Номенклатура.ЕдиницаИзмерения;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВНовыйЗаказ(Команда)
	
	Если Объект.СоставКорзины.Количество() = 0 Тогда
		ТекстСообщения = "Нет товаров для переноса.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ТоварыКорзины = ПолучитьТоварыКорзины();
	
	Если ТоварыКорзины = Неопределено Тогда
	  Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТоварыКорзины", ТоварыКорзины);
	
	ОткрытьФорму("Документ.Заказ.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти
